#+Include: ../../doc.templates/title-injects.org
#+Include: ../../preamble.org

** DONE Rumor 

#+name: rumor  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=9
library(whisker)
cs <- read.csv2("../../data.out/ft_rumors.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdRumor,cs$IdPerson), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

cs$rank <- sequence(rle(cs$IdRumor)$lengths)
cs$F <- cs$rank==1

sel <- if (nrow(cs)>0) {which( with( cs, 
 {tmp <- logical(length(cs$IdRumor)); 
 split(tmp, cs$IdRumor) <- lapply(split(rank, cs$IdRumor), function(x) x==max(x));
 tmp}))}

if (nrow(cs)>0) {cs$L <- F; cs$L[sel]<-T}

rumor <- unname(rowSplit(cs))

f <- "rumor.org"
contents <- readChar(f, file.info(f)$size)
f <- "person.org"
person <- readChar(f, file.info(f)$size)
f <- "symptoms.org"
symptoms <- readChar(f, file.info(f)$size)

text <- whisker.render(contents, partials=list(person=person, symptoms=symptoms))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: rumor
:RESULTS:

   
   /Rumor [fn:: Place -- 4563]/

   #+Attr_Latex: :center nil :booktabs t
   |----------------------+--------------------------------------------------|
   | Notified by          | Ogunbanwo Buhari                   |
   | \ldots Phone         | +234-38-5315270 landline                    |
   | \ldots Email         | ogunbanwo.buhari@sormas.ng                                      |
   |----------------------+--------------------------------------------------|
   | Date of Event        | 2015-06-09                                    |
   | Type of Place        | Home                        |
   | Address              | Adeshina Street \ldots Ojete         |
   | LGA \ldots State     | Kajola \ldots  Oyo              |
   | Description of Place | /Please describe the place with your own words./ |
   | Rumor Description    | /After having viewed all information/            |
   |                      | /please invent further details and/              |
   |                      | /describe the rumor with your own words./        |
   |----------------------+--------------------------------------------------|
  
   $\ldots$ /Person [fn:: Person -- 3235]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Isoken Novia                                                                |          |
   | Sex \ldots Age \ldots DoB | female \ldots 17 \ldots                                      |
   | Marital State             | married (and not separated)                                                                          |          |
   | Home Address              | Layi Oyekanmi Street \ldots Ilua \ldots Kajola \ldots Oyo                            |          |
   | Phone-1                   | +234-805-1650516 mobile                                                                 |          |
   | Phone-2                   | +234-809-3704544 mobile                                                                 |          |
   | Occupation                | philosopher                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 3239]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person seemed very sick./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Adaze Henshaw                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 20 \ldots                                      |
   | Marital State             | living common law                                                                          |          |
   | Home Address              | Dolphin Estate IV Phase II Road \ldots Kajola \ldots Kajola \ldots Oyo                            |          |
   | Phone-1                   | 0703-5894209 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | student                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 3247]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Asuquo Nguirmamaramama                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 44 \ldots                                      |
   | Marital State             | single (not living common law)                                                                          |          |
   | Home Address              | Emma Azuka Street \ldots Apa Obe \ldots Kajola \ldots Oyo                            |          |
   | Phone-1                   | 0809-8737004 mobile                                                                 |          |
   | Phone-2                   | +234-805-4942077 mobile                                                                 |          |
   | Occupation                | police officer                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 3315]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Clinton Mamudu                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 63 \ldots                                      |
   | Marital State             | married (and not separated)                                                                          |          |
   | Home Address              | Denton Street \ldots Egbebi \ldots Kajola \ldots Oyo                            |          |
   | Phone-1                   | 0706-3022821 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | sales assistant (salesperson)                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 3377]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Bukola Odita                                                                |          |
   | Sex \ldots Age \ldots DoB | female \ldots 61 \ldots                                      |
   | Marital State             | divorced (not living common law)                                                                          |          |
   | Home Address              | Industry Road \ldots Agunyansuneja \ldots Kajola \ldots Oyo                            |          |
   | Phone-1                   | 0803-3565018 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | physician                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   
   $\blacksquare$ \medskip 
   

:END:

** DONE Cases of Death

#+name: pdeath  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=25
library(whisker)
cs <- read.csv2("../../data.out/ft_cases.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$DateOfDeathDay==day,]
cs <- cs[!is.na(cs$DateOfDeathDay),]

case <- unname(rowSplit(cs))

f <- "case-death.org"
template <- readChar(f, file.info(f)$size)

text <- whisker.render(template)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: pdeath
:RESULTS:

   /Case of death[fn:: Person -- 4306]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Uche Odunlami                    |
   | Sex \ldots DoB \ldots Age | male \ldots NA \ldots 1961-02-13 |
   | Date of Death             | 2015-06-25                          |
   |---------------------------+-----------------------------------------------|
   
   \medskip


:END:

